<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PostsTableSeeder extends Seeder
{
    public function run()
    {
        DB::table('posts')->insert([
            [
                'title' => '444أهمية التبرع بالدم',
                'image' => 'image1.jpg',
                'content' => 'يعتبر التبرع بالدم من أهم الأمور الصحية التي تساهم في إنقاذ حياة العديد من المرضى.',
                'category_id' => 1,
            ],
            [
                'title' => '2222أهمية التبرع بالدم',
                'image' => 'image1.jpg',
                'content' => 'يعتبر التبرع بالدم من أهم الأمور الصحية التي تساهم في إنقاذ حياة العديد من المرضى.',
                'category_id' => 2,
            ],
            [
                'title' => '333أهمية التبرع بالدم',
                'image' => 'image1.jpg',
                'content' => 'يعتبر التبرع بالدم من أهم الأمور الصحية التي تساهم في إنقاذ حياة العديد من المرضى.',
                'category_id' => 3,
            ],
            [
                'title' => '444أهمية التبرع بالدم',
                'image' => 'image1.jpg',
                'content' => 'يعتبر التبرع بالدم من أهم الأمور الصحية التي تساهم في إنقاذ حياة العديد من المرضى.',
                'category_id' => 3,
            ],
            [
                'title' => '555أهمية التبرع بالدم',
                'image' => 'image1.jpg',
                'content' => 'يعتبر التبرع بالدم من أهم الأمور الصحية التي تساهم في إنقاذ حياة العديد من المرضى.',
                'category_id' => 4,
            ],
            [
                'title' => '66أهمية التبرع بالدم',
                'image' => 'image1.jpg',
                'content' => 'يعتبر التبرع بالدم من أهم الأمور الصحية التي تساهم في إنقاذ حياة العديد من المرضى.',
                'category_id' => 2,
            ],
            [
                'title' => '777أهمية التبرع بالدم',
                'image' => 'image1.jpg',
                'content' => 'يعتبر التبرع بالدم من أهم الأمور الصحية التي تساهم في إنقاذ حياة العديد من المرضى.',
                'category_id' => 1,
            ],
            [
                'title' => ' التبرع بالدم',
                'image' => 'image1.jpg',
                'content' => 'إنقاذ حياة العديد من المرضإنقاذ حياة العديد من المرضإنقاذ حياة العديد من المرضإنقاذ حياة العديد من المرضيعتبر التبرع بالدم من أهم الأمور الصحية التي تساهم في إنقاذ حياة العديد من المرضى.',
                'category_id' => 3,
            ],
           
        ]);
    }
}
